dbetz/ch559usbhost/main.c
typedef unsigned char *PUINT8;
typedef unsigned char __xdata *PUINT8X;
typedef const unsigned char __code *PUINT8C;
typedef unsigned char __xdata UINT8X;
typedef unsigned char  __data             UINT8D;

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "CH559.h"
#include "util.h"
#include "USBHost.h"
#include "uart.h"
#include "protocol.h"

SBIT(LED, 0x90, 6);
SBIT(LED32, 0xB0, 2);

void main()
{
    unsigned char s;
    initClock();

	PORT_CFG &= ~bP3_OC;
	PORT_CFG |= bP3_DRV;
	P3_DIR |= (1 << 2);
    LED32 = 1;
    
    initUART0(230400, 1);
    DEBUG_OUT("Startup\n");
    resetHubDevices(0);
    resetHubDevices(1);
    initUSB_Host();
    
    DEBUG_OUT("Ready\n");
	sendProtocolMSG(MSG_TYPE_STARTUP,0, 0x00, 0x00, 0x00, 0);
    while(1)
    {
        if(!(P4_IN & (1 << 6)))
            runBootloader();
        processUart();
        s = checkRootHubConnections();
        pollHIDdevice();
    }
}
